#+TITLE: Shells
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="solarized-light.css" />

* SQLite
    :PROPERTIES:
    :header-args: :tangle ~/.sqliterc
    :END:

    SQLite has a configuration file that gets executed every time is
  launched.  I like to change the default glyph for the =NULL= value

  #+begin_src conf
    .nullvalue '⊥'
  #+end_src

  and enable the =box= mode.  This is kinda new, so it may not work in
  some older version

  #+begin_src conf
    .mode box
  #+end_src

  It looks like this:

  #+begin_src sqlite :tangle no :db "" :results verbatim :exports both
    .mode box
    select 42 as response;
  #+end_src

  #+RESULTS:
  | ┌──────────┐ |
  | │ response │ |
  | ├──────────┤ |
  | │ 42       │ |
  | └──────────┘ |

